Repository: 11ALX11/calc-arithmetics
Catalog: locales/*/LC_MESSAGES/default.po
Languages: ru_ru

source: Test
ru_ru: Тест

source: Use a command-line interface
ru_ru: Использование интерфейса командной строки (CLI)

source: cli not supported yet.
ru_ru: cli пока не поддерживается.

source: Use a console-based interface
ru_ru: Использование интерфейса консоли

source: console not supported yet.
ru_ru: console пока не поддерживается.

source: Use a graphic user interface
ru_ru: Использование графического интерфейса

source: gui not supported yet.
ru_ru: gui пока не поддерживается.

source: Find all arithmetic operations, calculate and replace.
ru_ru: Находит все арифметические действия, считает и заменяет их.

source: Find all arithmetic operations in the input file, calculate and replace with the results in the output file.
ru_ru: Находит все арифметические операции во входном файле, считает и заменяет их результатами в выходном файле.

source: Use a web-based interface
ru_ru: Использование веб-интерфейса

source: web not supported yet.
ru_ru: web пока не поддерживается.

source: failed to initialize i18n: %v
ru_ru: Не удалось инициализировать i18n: %v

source: Path to file to read input data from:
ru_ru: Путь к файлу для чтения входных данных:

source: Is input file an archive? (y/N):
ru_ru: Входной файл — архив? (y/N):

source: Name of the file inside the ZIP to read (data.txt):
ru_ru: Имя файла внутри ZIP-архива для чтения (data.txt):

source: Is input file encoded? (y/N):
ru_ru: Входной файл закодирован? (y/N):

source: Path to file with encryption key:
ru_ru: Путь к файлу с ключом шифрования:

source: Use evaluation library? (y/N):
ru_ru: Использовать библиотеку для вычисления выражений? (y/N):

source: Use regex for filtering arithmetic expressions? (y/N):
ru_ru: Использовать регулярное выражение для фильтрации арифметических выражений? (y/N):

source: Do you wish to encrypt result? (y/N):
ru_ru: Хотите зашифровать результат? (y/N):

source: Path to file to write result to:
ru_ru: Путь к файлу для записи результата:

source: Do you wish to archive output file? (y/N):
ru_ru: Хотите архивировать выходной файл? (y/N):

source: Also print the results to the console? (y/N):
ru_ru: Также вывести результаты на консоль? (y/N):
